Reports/бит_ВыгрузкаОплатПоДням.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Report>
		<Properties>
			<Name>бит_ВыгрузкаОплатПоДням</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Каталог</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КонецПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НачалоПериода</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Адреса</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Адрес</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_СписокЗданий</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ВидыОплат</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВыполняетсяОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидОплаты</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.лб_ВидыОплат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Начисления</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВыполняетсяОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Начисление</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_УслугиЖКХ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ТипыКвартир</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВыполняетсяОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКвартиры</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_ТипыКвартиры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Участки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ВыполняетсяОтбор</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Участок</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.бит_АдминистративныеОкруга</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Report>
</MetaDataObject>

Reports/бит_ВыгрузкаОплатПоДням/Forms/ФормаОтчета/Ext/Form/Module.bsl
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Разделитель = ";";
	СпособДетализации = 1;
	ЗаполнитьНачисления();
	ЗаполнитьУчастки();
	ЗаполнитьТипыКвартир();
	ЗаполнитьВидыОплат();
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьНачисления()
	
	Отчет.Начисления.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_УслугиЖКХ.Ссылка КАК Начисление
		|ИЗ
		|	Справочник.бит_УслугиЖКХ КАК бит_УслугиЖКХ
		|ГДЕ
		|	НЕ бит_УслугиЖКХ.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_УслугиЖКХ.Приоритет";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаНачисления = Отчет.Начисления.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаНачисления, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьУчастки()
	
	Отчет.Участки.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_АдминистративныеОкруга.Ссылка КАК Участок
		|ИЗ
		|	Справочник.бит_АдминистративныеОкруга КАК бит_АдминистративныеОкруга
		|ГДЕ
		|	НЕ бит_АдминистративныеОкруга.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_АдминистративныеОкруга.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаУчастки = Отчет.Участки.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаУчастки, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТипыКвартир()
	
	Отчет.ТипыКвартир.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	бит_ТипыКвартиры.Ссылка КАК ТипКвартиры
		|ИЗ
		|	Справочник.бит_ТипыКвартиры КАК бит_ТипыКвартиры
		|ГДЕ
		|	НЕ бит_ТипыКвартиры.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	бит_ТипыКвартиры.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаТК = Отчет.ТипыКвартир.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаТК, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьВидыОплат()
	
	Отчет.ВидыОплат.Очистить();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	лб_ВидыОплат.Ссылка КАК ВидОплаты
		|ИЗ
		|	Справочник.лб_ВидыОплат КАК лб_ВидыОплат
		|ГДЕ
		|	НЕ лб_ВидыОплат.ПометкаУдаления
		|
		|УПОРЯДОЧИТЬ ПО
		|	лб_ВидыОплат.Наименование";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		НоваяСтрокаВО = Отчет.ВидыОплат.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрокаВО, ВыборкаДетальныеЗаписи);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура КаталогНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	
	ДиалогВыбораКаталогаИмпорта = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.ВыборКаталога);
	ДиалогВыбораКаталогаИмпорта.Заголовок = "Выберите каталог для выгрузки ";
	ДиалогВыбораКаталогаИмпорта.ПроверятьСуществованиеФайла = Истина;
	ДиалогВыбораКаталогаИмпорта.Каталог = Отчет.Каталог;
	
	Оповещение = Новый ОписаниеОповещения("ВыборКаталогаЗавершение", ЭтотОбъект);
	ДиалогВыбораКаталогаИмпорта.Показать(Оповещение);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыборКаталогаЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если НЕ Результат = Неопределено Тогда
		Отчет.Каталог = Результат[0];
	Иначе
		ПоказатьПредупреждение(,"Каталог не выбран!");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериод(Команда)
	
	ПараметрыВыбора = Новый Структура("НачалоПериода,КонецПериода", Отчет.НачалоПериода, Отчет.КонецПериода);
 	ОписаниеОповещения = Новый ОписаниеОповещения("ВыбратьПериодЗавершение", ЭтотОбъект);
	ОткрытьФорму("ОбщаяФорма.ВыборСтандартногоПериода", ПараметрыВыбора, Элементы.ВыбратьПериод, , , , ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВыбратьПериодЗавершение(РезультатВыбора, ДопПараметры) Экспорт
	
	Если РезультатВыбора = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Отчет.НачалоПериода = РезультатВыбора.НачалоПериода;
	Отчет.КонецПериода = РезультатВыбора.КонецПериода;
	
КонецПроцедуры

&НаКлиенте
Процедура Начисления_УстановитьФлажки(Команда)
	
	Для каждого НачисленияСтрока Из Отчет.Начисления Цикл
		НачисленияСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура Начисления_СнятьФлажки(Команда)
	
	Для каждого НачисленияСтрока Из Отчет.Начисления Цикл
		НачисленияСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_УстановитьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Отчет.Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура Участки_СнятьФлажки(Команда)
	
	Для каждого УчасткиСтрока Из Отчет.Участки Цикл
		УчасткиСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКвартир_УстановитьФлажки(Команда)
	
	Для каждого ТипыКвартирСтрока Из Отчет.ТипыКвартир Цикл
		ТипыКвартирСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла; 
	
КонецПроцедуры

&НаКлиенте
Процедура ТипыКвартир_СнятьФлажки(Команда)
	
	Для каждого ТипыКвартирСтрока Из Отчет.ТипыКвартир Цикл
		ТипыКвартирСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыОплат_УстановитьФлажки(Команда)
	
	Для каждого ВидОплСтрока Из Отчет.ВидыОплат Цикл
		ВидОплСтрока.ВыполняетсяОтбор = Истина;	
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ВидыОплат_СнятьФлажки(Команда)
	
	Для каждого ВидОплСтрока Из Отчет.ВидыОплат Цикл
		ВидОплСтрока.ВыполняетсяОтбор = Ложь;	
	КонецЦикла;
	
КонецПроцедуры
 
&НаКлиенте
Процедура СформироватьФайлCSV(Команда)
	
	ОчиститьСообщения();
	
	Если Не ЗначениеЗаполнено(Отчет.Каталог) Тогда
		Сообщить("Не заполнен каталог!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.НачалоПериода) Тогда
		Сообщить("Не заполнено начало периода!");
		Возврат;
	КонецЕсли; 
	
	Если Не ЗначениеЗаполнено(Отчет.КонецПериода) Тогда
		Сообщить("Не заполнен конец периода!");
		Возврат;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Отчет.Организация) Тогда
		Сообщить("Не заполнена организация!");
		Возврат;
	КонецЕсли;
	
	СформироватьОтчет();
	
	СохранитьФайлНаКлиенте();
	
КонецПроцедуры

&НаСервере
Процедура СформироватьОтчет()
	
	СкомпоноватьРезультат();
	
	ИмяВременногоФайла = ПолучитьИмяВременногоФайла("xlsx");
	Результат.Записать(ИмяВременногоФайла, ТипФайлаТабличногоДокумента.XLSX);
	АдресВоВременномХранилище = ПоместитьВоВременноеХранилище(Новый ДвоичныеДанные(ИмяВременногоФайла), УникальныйИдентификатор);
	
	Попытка
		УдалитьФайлы(ИмяВременногоФайла);
	Исключение
		//ОписаниеОшибки()
	КонецПопытки;
	
КонецПроцедуры

&НаКлиенте
Процедура СохранитьФайлНаКлиенте()
	
	ПолноеИмяФайла = Отчет.Каталог + "\" + Формат(ТекущаяДата(),"ДФ='dd-MM-yyyy HH.mm.ss'") + ".xlsx";
	
	Если ЗначениеЗаполнено(Отчет.ИмяФайла) Тогда
		ПолноеИмяФайла = Отчет.Каталог + "\" + Отчет.ИмяФайла + ".xlsx";	
	КонецЕсли; 
	
	Попытка
		
		ПолучитьФайл(АдресВоВременномХранилище, ПолноеИмяФайла, Ложь);
		
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Создан файл: " + ПолноеИмяФайла;
		Сообщение.Сообщить();
		
	Исключение
	    Сообщить(ОписаниеОшибки());
	КонецПопытки; 
	
КонецПроцедуры
